blueskycoco/d5/SRC/DRIVERS/DISPLAY/lpc32xx_lcd.cpp
//*********************************************************************
//* Software that is described herein is for illustrative purposes only  
//* which provides customers with programming information regarding the  
//* products. This software is supplied "AS IS" without any warranties.  
//* NXP Semiconductors assumes no responsibility or liability for the 
//* use of the software, conveys no license or title under any patent, 
//* copyright, or mask work right to the product. NXP Semiconductors 
//* reserves the right to make changes in the software without 
//* notification. NXP Semiconductors also make no representation or 
//* warranty that such application will be suitable for the specified 
//* use without further testing or modification. 
//*
//* Copyright NXP Semiconductors
//*********************************************************************
//
// lpc32xx_lcd.cpp
//
// This file implements basic flat display driver. Informations about
// supported display modes and switching between them are offloaded to kernel
// via KernelIoControl calls.
//

#define DDI 1
#include "precomp.h"
#include <windows.h>
#include <types.h>
#include <winddi.h>
#include <gpe.h>
#include <emul.h>
#include <ceddk.h>
#include <dispperf.h>
#include <pkfuncs.h>
#include <ddhal.h>
#include "lpc32xx_lcd.h"
#include "lcd_panel_types.h"
#include "lpc32xx_gpio.h"
#include "bsp.h"

#define dim(x) (sizeof(x) / sizeof(x[0]))

//------------------------------------------------------------------------------
// Debug Zones (only for retail)
//#ifndef SHIP_BUILD
INSTANTIATE_GPE_ZONES(0x03, "MGDI Driver", "error", "warn")
#undef  ZONE_ERROR
#undef  ZONE_WARN
#undef  ZONE_FUNCTION
#undef  ZONE_INIT
#undef  ZONE_INFO

#define ZONE_ERROR          DEBUGZONE(0)
#define ZONE_WARN           DEBUGZONE(1)
#define ZONE_FUNCTION       DEBUGZONE(2)
#define ZONE_INIT           DEBUGZONE(3)
#define ZONE_INFO           DEBUGZONE(4)
//#endif

//------------------------------------------------------------------------------
// Static variables  
static GPE *g_pGPE = (GPE *) NULL;
static TCHAR gszBaseInstance[256] = _T("Drivers\\Display\\LPC32XX\\CONFIG");
static DWORD PanelType = 0;

//------------------------------------------------------------------------------
// External functions
BOOL APIENTRY GPEEnableDriver(
   ULONG version, ULONG cj, DRVENABLEDATA *pData, ENGCALLBACKS *pCallbacks
);

//------------------------------------------------------------------------------
//
//  Function:  DisplayInit
//
//  The GWES will invoke this routine once prior to making any other calls
//  into the driver. This routine needs to save its instance path information
//  and return TRUE.  If it returns FALSE, GWES will abort the display
//  initialization.
//
BOOL DisplayInit(LPCTSTR pszInstance, DWORD monitors)
{
	// Save copy of instance base
    if(pszInstance != NULL) {
        _tcsncpy(gszBaseInstance, pszInstance, dim(gszBaseInstance));
    }

    g_pGPE = new LPC32XXLCD;

    return TRUE;
}

//------------------------------------------------------------------------------
//
//  Function:  DrvEnableDriver
//
//  This function must be exported from display driver. As long as we use
//  GPE class implementation we don't need do anything else than call
//  GPEEnableDriver library function.
//
BOOL DrvEnableDriver(
    ULONG version, ULONG cj, DRVENABLEDATA *pData, ENGCALLBACKS *pCallbacks
) {
    BOOL rc;

    rc = GPEEnableDriver(version, cj, pData, pCallbacks);

    return rc;
}

//------------------------------------------------------------------------------
//
//  Function:  DrvGetMasks
//
ULONG *APIENTRY DrvGetMasks(DHPDEV dhpdev)
{
    return LCDPanelList[PanelType].m_BitMasks;
}

//------------------------------------------------------------------------------
//
//  Function:  RegisterDDHALAPI
//
VOID RegisterDDHALAPI()
{
    DEBUGMSG(ZONE_FUNCTION, (L"+RegisterDDHALAPI\r\n"));
}

//------------------------------------------------------------------------------
//
//  Function:  GetGPE
//
//  This function is called from GPE class library to get pointer to class
//  deriver from GPE.
//
GPE* GetGPE()
{
    return g_pGPE;
}    

//------------------------------------------------------------------------------
//
//  Function:  lcd_update_clock
//
//  Sets the LCD clock.
//
void LPC32XXLCD::lcd_update_clock(UINT32 desired_clock)
{
    UINT32 pixel_div, tmp;
    DWORD clk, bytesret;

	// Get base clock for LCD (HCLK)
	if (KernelIoControl(IOCTL_LPC32XX_GETHCLK, NULL, 0, &clk,
		sizeof (clk), &bytesret) == FALSE)
	{
		// Cannot get clock
        RETAILMSG(1, (_T("lcd_update_clock: lcd_update_clock: Error getting LCD base clock\r\n")));
        RETAILMSG(1, (_T("lcd_update_clock: Using 104MHz for the base clock\r\n")));
        clk = 104000000;
	}

	// Find closest clock divider to get clock rate
	pixel_div = 1;
	while (((clk / pixel_div) > desired_clock) && (pixel_div < 0x3F)) {
		pixel_div++;
	}

   DEBUGMSG(ZONE_INFO, (_T("LCD: lcd_update_clock: Base clock %d, divider %d, LCD clock %d\r\n"),
	   clk, pixel_div, clk/pixel_div));

	tmp = pLCDRegs->lcdpol;

	if (pixel_div <= 1)
    {
        /* Pixel clock divider is 1, skip divider logic */
        tmp |= CLCDC_LCDTIMING2_BCD;
    }
    else
    {
        // Add in new divider
        tmp &= ~(CLCDC_LCDTIMING2_BCD | CLCDC_LCDTIMING2_PCD(0x1F) | 0xF8000000);
		tmp |= (pixel_div & 0x1F);
		tmp |= (((pixel_div >> 5) & 0x1F) << 27);
    }

    pLCDRegs->lcdpol = tmp;
}

//------------------------------------------------------------------------------
//
//  Constructor
//
void LPC32XXLCD::lpc32xx_hw_init(void)
{
    HKEY hkDisplay = NULL;
    DWORD dwStatus, dwType, dwSize, tmp, bsize, UseIRAM, phya;
    PHYSICAL_ADDRESS pa;
	GPIO_REGS_T *pGPIOREGs;

	// Open the registry key and read our configuration
    dwStatus = RegOpenKeyEx(HKEY_LOCAL_MACHINE, gszBaseInstance, 0, 0, &hkDisplay);
    if (dwStatus != ERROR_SUCCESS) {
        RETAILMSG(1, (_T("LCD: lpc32xx_hw_init: Error opening registry!\r\n")));
        return;
    }
	else
	{
		// Get panel type from the register, the panel type matches the panels
		// index specified in the panels.cpp list.
		PanelType = 0xffff;
        dwSize = sizeof(DWORD);
	    dwType = REG_DWORD;
        dwStatus = RegQueryValueEx(hkDisplay, _T("LCDPanelType"), NULL, &dwType, 
            (LPBYTE) &PanelType, &dwSize);

	    // Sanity checks
		if (dwStatus != ERROR_SUCCESS) {
	        DEBUGMSG(ZONE_WARN,
				(_T("LCD: lpc32xx_hw_init: No panel type found, using 0!\r\n")));
			PanelType = 0;
		}
		if (PanelType > (LCD_MAX_PANELS - 1)) {
		    RETAILMSG(1,
				(_T("LCD: lpc32xx_hw_init: Invalid panel type, use 0!\r\n")));
			PanelType = 0;
	    }

		// Get IRAM use flag
		// Get panel type from the register, the panel type matches the panels
		// index specified in the panels.cpp list.
		UseIRAM = 1;
        dwSize = sizeof(DWORD);
	    dwType = REG_DWORD;
        dwStatus = RegQueryValueEx(hkDisplay, _T("UseIRAM"), NULL, &dwType, 
            (LPBYTE) &UseIRAM, &dwSize);

		if (dwStatus != ERROR_SUCCESS) {
	        DEBUGMSG(ZONE_WARN,
				(_T("LCD: lpc32xx_hw_init: Using IRAM for LCD buffer\r\n")));
			UseIRAM = 1;
		}
	}
    
