blueskycoco/d5/SRC/DRIVERS/DISPLAY/lpc32xx_lcd.cpp
    // Close the registry key
    if (hkDisplay != NULL) {
        RegCloseKey(hkDisplay);
    }

	// Only TFT panels on 16bpp and 24bpp are supported
	if (LCDPanelList[PanelType].lcd_panel_type != TFT) {
        RETAILMSG(1, (_T("LCD: lpc32xx_hw_init: Not a TFT panel!\r\n")));
        return;
    }

	// Get pointer to registers used in this driver
    pa.QuadPart = LCD_BASE;
	pLCDRegs = (CLCDC_REGS_T *) MmMapIoSpace(pa, sizeof (CLCDC_REGS_T), FALSE);
    pa.QuadPart = CLK_PM_BASE;
	pCLKPWRRegs = (CLKPWR_REGS_T *)
		MmMapIoSpace(pa, sizeof (CLKPWR_REGS_T), FALSE);
	
	if ((pLCDRegs == NULL) || (pCLKPWRRegs == NULL))
	{
		RETAILMSG(1, (_T("LCD: lpc32xx_hw_init: Critcal error: cannot map registers!\r\n")));
		if (pLCDRegs != NULL)
		{
			MmUnmapIoSpace(pLCDRegs, sizeof(CLCDC_REGS_T));
		}
		if (pCLKPWRRegs != NULL)
		{
			MmUnmapIoSpace(pCLKPWRRegs, sizeof(CLKPWR_REGS_T));
		}

		return;
	}

	if (LCDPanelList[PanelType].bits_per_pixel == 16) {
		tmp = CLKPWR_LCDCTRL_LCDTYPE_TFT16;
		bsize = 2;
	}
	else if (LCDPanelList[PanelType].bits_per_pixel == 24) {
		tmp = CLKPWR_LCDCTRL_LCDTYPE_TFT24;
		bsize = 4;
	}
	else {
        RETAILMSG(1, (_T("LCD: lpc32xx_hw_init: Unsupported color depth!\r\n")));
        return;
	}

	// Enough memory for frame buffer?
	if ((LCDPanelList[PanelType].pixels_per_line *
		LCDPanelList[PanelType].lines_per_panel * bsize) >
		IMAGE_WINCE_LCD_BUFFERS_SIZE) {
        RETAILMSG(1, (_T("LCD: lpc32xx_hw_init: Frame buffer not big enough!\r\n")));
        return;
	}

	// Enable LCD clocks and setup prescaler to 1
	pCLKPWRRegs->clkpwr_lcdclk_ctrl = (tmp | CLKPWR_LCDCTRL_CLK_EN);

	// Configure LCD based on selected panel type
    pLCDRegs->lcdctrl &= ~CLCDC_LCDCTRL_ENABLE;

    // Generate the timing 0 word
    tmp = (CLCDC_LCDTIMING0_PPL(LCDPanelList[PanelType].pixels_per_line) |
        CLCDC_LCDTIMING0_HSW(LCDPanelList[PanelType].h_sync_pulse_width) |
        CLCDC_LCDTIMING0_HFP(LCDPanelList[PanelType].h_front_porch) |
        CLCDC_LCDTIMING0_HBP(LCDPanelList[PanelType].h_back_porch));
    pLCDRegs->lcdtimh = tmp;

    // Generate the timing 1 word
    tmp = (CLCDC_LCDTIMING1_LPP(LCDPanelList[PanelType].lines_per_panel) |
        CLCDC_LCDTIMING1_VSW(LCDPanelList[PanelType].v_sync_pulse_width) |
        CLCDC_LCDTIMING1_VFP(LCDPanelList[PanelType].v_front_porch) |
        CLCDC_LCDTIMING1_VBP(LCDPanelList[PanelType].v_back_porch));
    pLCDRegs->lcdtimv = tmp;

    // Generate the timing 2 word
    tmp = CLCDC_LCDTIMING2_ACB(LCDPanelList[PanelType].ac_bias_frequency);
    if (LCDPanelList[PanelType].invert_output_enable != 0)
    {
        tmp |= CLCDC_LCDTIMING2_IOE;
    }
    if (LCDPanelList[PanelType].invert_panel_clock != 0)
    {
        tmp |= CLCDC_LCDTIMING2_IPC;
    }
    if (LCDPanelList[PanelType].invert_hsync != 0)
    {
        tmp |= CLCDC_LCDTIMING2_IHS;
    }
    if (LCDPanelList[PanelType].invert_vsync != 0)
    {
        tmp |= CLCDC_LCDTIMING2_IVS;
    }

    // Clocks per line and pixels per line are the same
    tmp = tmp | CLCDC_LCDTIMING2_CPL(
		LCDPanelList[PanelType].pixels_per_line - 1);
    pLCDRegs->lcdpol = tmp;

    // Update timing 2 word with correct clock data
    lcd_update_clock(LCDPanelList[PanelType].optimal_clock);

    // Skip timing 3 word - just set to 0x0
    pLCDRegs->lcdle = 0x00000000;

    // Default with all interrupts off
    pLCDRegs->lcdintrenable = 0x00000000; 

#if 0 // SDRAM only version
    // Default configuration is 16 bits per pixel with blue and
    // green not swapped
	if (LCDPanelList[PanelType].bits_per_pixel == 16) {
		tmp = CLCDC_LCDCTRL_BPP16_565;
	}
	else
	{
		tmp = CLCDC_LCDCTRL_BPP24;
	}
    pLCDRegs->lcdctrl = (tmp | CLCDC_LCDCTRL_RGB | CLCDC_LCDCTRL_TFT);

	// Setup frame buffer
	pLCDRegs->lcdupbase = IMAGE_WINCE_LCD_BUFFERS_PA;

	// Enable LCD
	pLCDRegs->lcdctrl |= (CLCDC_LCDCTRL_ENABLE | CLCDC_LCDCTRL_PWR);

	// Enable LCD and backlight power
    pa.QuadPart = GPIO_BASE;
	pGPIOREGs = (GPIO_REGS_T *) MmMapIoSpace(pa, sizeof (GPIO_REGS_T), FALSE);
	pGPIOREGs->pio_outp_set = _BIT(0);
	pGPIOREGs->pio_outp_clr = _BIT(4);
    MmUnmapIoSpace((PVOID) pGPIOREGs, 0);

    // Setup up display mode related constants
    m_nScreenWidth = LCDPanelList[PanelType].pixels_per_line;
    m_nScreenHeight = LCDPanelList[PanelType].lines_per_panel;
    m_colorDepth = LCDPanelList[PanelType].bits_per_pixel;
    m_cbScanLineLength = LCDPanelList[PanelType].pixels_per_line * bsize;
    m_FrameBufferSize = m_nScreenHeight * m_cbScanLineLength;

	// Allocate virtual memory for frame buffer
    m_VirtualFrameBuffer = (DWORD) VirtualAlloc(NULL, m_FrameBufferSize,
		MEM_RESERVE, (PAGE_READWRITE | PAGE_NOCACHE));
    if (!m_VirtualFrameBuffer)
    {
        RETAILMSG(1, (TEXT("m_VirtualFrameBuffer is not allocated\n\r")));
        return;
    }
    if (!VirtualCopy((PVOID)m_VirtualFrameBuffer, (PVOID) (IMAGE_WINCE_LCD_BUFFERS_PA >> 8),
		m_FrameBufferSize, (PAGE_READWRITE | PAGE_NOCACHE | PAGE_PHYSICAL)))
    {
        RETAILMSG(1, (TEXT("m_VirtualFrameBuffer is not mapped\n\r")));
        VirtualFree((PVOID)m_VirtualFrameBuffer, 0, MEM_RELEASE);
        return;
    }

    RETAILMSG(1, (TEXT("m_VirtualFrameBuffer is mapped at %x(PHY : %x)\n\r"),
		m_VirtualFrameBuffer, IMAGE_WINCE_LCD_BUFFERS_PA));

#else // SDRAM and IRAM version
    // Default configuration is 16 bits per pixel with blue and
    // green not swapped
	if (LCDPanelList[PanelType].bits_per_pixel == 16) {
		tmp = CLCDC_LCDCTRL_BPP16_565;
	}
	else
	{
		tmp = CLCDC_LCDCTRL_BPP24;
	}
    pLCDRegs->lcdctrl = (tmp | CLCDC_LCDCTRL_RGB | CLCDC_LCDCTRL_TFT);

    // Setup up display mode related constants
    m_nScreenWidth = LCDPanelList[PanelType].pixels_per_line;
    m_nScreenHeight = LCDPanelList[PanelType].lines_per_panel;
    m_colorDepth = LCDPanelList[PanelType].bits_per_pixel;
    m_cbScanLineLength = LCDPanelList[PanelType].pixels_per_line * bsize;
    m_FrameBufferSize = m_nScreenHeight * m_cbScanLineLength;

	// Allocate virtual memory for frame buffer
    m_VirtualFrameBuffer = (DWORD) VirtualAlloc(NULL, m_FrameBufferSize,
		MEM_RESERVE, (PAGE_READWRITE | PAGE_NOCACHE));
    if (!m_VirtualFrameBuffer)
    {
        RETAILMSG(1, (TEXT("m_VirtualFrameBuffer is not allocated\n\r")));
        return;
    }

	// Setup frame buffer
	phya = IMAGE_WINCE_LCD_BUFFERS_PA;
	if ((UseIRAM == 1) && (m_FrameBufferSize <= (256 * 1024)))
	{
		phya = DEVICE_IRAM_PA;
        RETAILMSG(1, (TEXT("Using IRAM for LCD buffer!!\n\r")));
	}

