blueskycoco/d5/SRC/DRIVERS/DISPLAY/lpc32xx_lcd.cpp
        // If line overlap cursor, turn if off
        RECTL cursorRect = m_cursorRect;
        RotateRectl (&cursorRect);

        if (cursorRect.top < bounds.bottom && 
            cursorRect.bottom > bounds.top &&
            cursorRect.left < bounds.right && 
            cursorRect.right > bounds.left
        ) { 
            CursorOff();
            m_cursorForcedOff = TRUE;
        }            
    }

    // Do emulated line
    sc = EmulatedLine(lineParameters);

    // If cursor was forced off turn it back on
    if (m_cursorForcedOff) {
        m_cursorForcedOff = FALSE;
        CursorOn();
    }

cleanUp:
    return sc;
}

//------------------------------------------------------------------------------
//
//  Method: Line
//
//  This method executes before and after a sequence of line segments,
//  which are drawn as a path. It examines the line parameters to determine
//  whether the operation can be accelerated. It also places a pointer to
//  a function to execute once per line segment into the pLine member
//  of the GPELineParms structure.
//
SCODE LPC32XXLCD::Line(GPELineParms *pLineParms, EGPEPhase phase)
{
    if (phase == gpeSingle || phase == gpePrepare) {
        if ((pLineParms->pDst != m_pPrimarySurface)) {
            pLineParms->pLine = &GPE::EmulatedLine;
        } else {
            pLineParms->pLine = 
				(SCODE (GPE::*)(struct GPELineParms *))&LPC32XXLCD::WrappedEmulatedLine;
        }            
    }
    return S_OK;
}

//------------------------------------------------------------------------------
//
//  Method:  BltPrepare
//
//  This method identifies the appropriate functions needed to perform
//  individual blits. This function executes before a sequence of clipped blit
//  operations.
//
SCODE LPC32XXLCD::BltPrepare(GPEBltParms *pBltParms)
{
    RECTL rect;
    LONG swapTmp;

	pBltParms->pBlt = &LPC32XXLCD::EmulatedBlt;

    // Check if destination overlap with cursor
    if (
        pBltParms->pDst == m_pPrimarySurface &&
        m_cursorVisible && !m_cursorDisabled
    ) { 
        if (pBltParms->prclDst != NULL) {
            rect = *pBltParms->prclDst;     // if so, use it

            // There is no guarantee of a well
            // ordered rect in blitParamters
            // due to flipping and mirroring.
            if (rect.top > rect.bottom) {
                swapTmp = rect.top;
                rect.top = rect.bottom;
                rect.bottom = swapTmp;
            }
            if (rect.left > rect.right) {
                swapTmp    = rect.left;
                rect.left  = rect.right;
                rect.right = swapTmp;
            }
        } else {
            rect = m_cursorRect;
        }

        // Turn off cursor if it overlap
        if (
            m_cursorRect.top <= rect.bottom &&
            m_cursorRect.bottom >= rect.top &&
            m_cursorRect.left <= rect.right &&
            m_cursorRect.right >= rect.left
        ) {
            CursorOff();
            m_cursorForcedOff = TRUE;
        }
    }

    // Check if source overlap with cursor
    if (
        pBltParms->pSrc == m_pPrimarySurface &&
        m_cursorVisible && !m_cursorDisabled
    ) {
        if (pBltParms->prclSrc != NULL) {
            rect = *pBltParms->prclSrc;
        } else {
            rect = m_cursorRect;
        }
        if (
            m_cursorRect.top < rect.bottom && m_cursorRect.bottom > rect.top &&
            m_cursorRect.left < rect.right && m_cursorRect.right > rect.left
        ) {
            CursorOff();
            m_cursorForcedOff = TRUE;
        }
    }

    return S_OK;
}

//------------------------------------------------------------------------------
//
//  Method:  BltComplete
//
//  This method executes to complete a blit sequence. 
//
SCODE LPC32XXLCD::BltComplete(GPEBltParms *pBtlParms)
{
    // If cursor was forced off turn it back on
    if (m_cursorForcedOff) {
        m_cursorForcedOff = FALSE;
        CursorOn();
    }
    return S_OK;
}

//------------------------------------------------------------------------------
//
//  Method:  CursorOn
//
VOID LPC32XXLCD::CursorOn()
{
    UCHAR *pFrame;
    UCHAR *pFrameLine, *pStoreLine, *pXorLine, *pAndLine, data;
    int bytesPerPixel, bytesPerLine;
    int xf, yf, xc, yc, i;

    DEBUGMSG(ZONE_FUNCTION, (L"+LPC32XXLCD::CursonOn\r\n"));

    // If cursor should not be visible or already is then exit
    if (m_cursorForcedOff || m_cursorDisabled || m_cursorVisible) goto cleanUp;

    if (m_cursorStore == NULL) {
        DEBUGMSG(ZONE_WARN, (L"LPC32XXLCD::CursorOn: "
            L"No cursor store available\r\n"
        ));
        goto cleanUp;
    }

    // We support only 1,2,3 and 4 bytes per pixel
    bytesPerPixel = (m_gpeMode.Bpp + 7) >> 3;
    if (bytesPerPixel <= 0 || bytesPerPixel > 4) goto cleanUp;
    
    // Get some base metrics
    pFrame = (UCHAR*)m_pPrimarySurface->Buffer();
    bytesPerLine = m_pPrimarySurface->Stride();

    for (yf = m_cursorRect.top, yc = 0; yf < m_cursorRect.bottom; yf++, yc++) {
        // Check if we are done
        if (yf < 0) continue;
        if (yf >= m_gpeMode.height) break;
    
        pFrameLine = &pFrame[yf * bytesPerLine];
        pStoreLine = &m_cursorStore[yc * m_cursorSize.x * bytesPerPixel];
        pAndLine = &m_cursorAnd[yc * m_cursorSize.x * bytesPerPixel];
        pXorLine = &m_cursorXor[yc * m_cursorSize.x * bytesPerPixel];
    
        for (
            xf = m_cursorRect.left, xc = 0; xf < m_cursorRect.right; xf++, xc++
        ) {
            // Check if we are done
            if (xf < 0) continue;
            if (xf >= m_gpeMode.width) break;

            // Depending on bytes per pixel
            switch (bytesPerPixel) {
            case 1:
                pStoreLine[xc] = pFrameLine[xf];
                pFrameLine[xf] &= pAndLine[xc];
                pFrameLine[xf] ^= pXorLine[xc];
                break;
            case 2:
                ((USHORT*)pStoreLine)[xc]  = ((USHORT*)pFrameLine)[xf];
                ((USHORT*)pFrameLine)[xf] &= ((USHORT*)pAndLine)[xc];
                ((USHORT*)pFrameLine)[xf] ^= ((USHORT*)pXorLine)[xc];
                break;
            case 3:
                for (i = 0; i < bytesPerPixel; i++) {
                    data = pFrameLine[xf * bytesPerPixel + i];
                    pStoreLine[xc * bytesPerPixel + i] = data;
                    data &= pAndLine[xc * bytesPerPixel + i];
                    data ^= pXorLine[xc * bytesPerPixel + i];
                    pFrameLine[xf * bytesPerPixel + i] = data;
                }                    
                break;
            case 4:
                ((ULONG*)pStoreLine)[xc]  = ((ULONG*)pFrameLine)[xf];
                ((ULONG*)pFrameLine)[xf] &= ((ULONG*)pAndLine)[xc];
                ((ULONG*)pFrameLine)[xf] ^= ((ULONG*)pXorLine)[xc];
                break;
            }                    
        }
    }
    
    // Cursor is visible now
    m_cursorVisible = TRUE;

cleanUp: 
    DEBUGMSG(ZONE_FUNCTION, (L"-LPC32XXLCD::CursonOn\r\n"));
    return;
}

//------------------------------------------------------------------------------

