blueskycoco/d5/SRC/DRIVERS/DISPLAY/lpc32xx_lcd.cpp
    DEBUGMSG(ZONE_FUNCTION, (L"-LPC32XXLCD::MovePointer(sc = 0x%08x)\r\n", S_OK));
    return  S_OK;
}

//------------------------------------------------------------------------------
//
//  Method:  InVBlank
//
int LPC32XXLCD::InVBlank()
{
    return 1;
}

//------------------------------------------------------------------------------
//
//  Method:  SetPalette
//
SCODE LPC32XXLCD::SetPalette(
    const PALETTEENTRY *pSource, WORD firstEntry, WORD numEntries
) {
    DEBUGMSG(ZONE_FUNCTION, (
        L"+LPC32XXLCD::SetPalette(0x%08x, %d, %d)\r\n", pSource, firstEntry,
        numEntries));

    return S_OK;
}

//------------------------------------------------------------------------------
//
//  Method:  PowerHandler
//
VOID LPC32XXLCD::PowerHandler(BOOL off)
{
    ULONG commands[2];
    
    // Ask HAL to set power
    commands[0] = DDHAL_COMMAND_POWER;
    commands[1] = off;
    if (!KernelIoControl(
        IOCTL_HAL_DDI, commands, sizeof(commands), NULL, 0, NULL
    )) {
        DEBUGMSG(ZONE_WARN, (L"LPC32XXLCD::PowerHandler: "
            L"IOCTL_HAL!DDI_POWER failed for off flag %d\r\n", off
        ));
    }
}

//------------------------------------------------------------------------------

void LPC32XXLCD::WaitForNotBusy()
{
    return;
}

int LPC32XXLCD::IsBusy()
{
    return 0;    // Never busy as there is no acceleration
}

void LPC32XXLCD::GetPhysicalVideoMemory(
    unsigned long * pPhysicalMemoryBase,
    unsigned long * pVideoMemorySize
    )
{
    *pPhysicalMemoryBase = (ULONG)m_VirtualFrameBuffer;
    *pVideoMemorySize    = m_FrameBufferSize;
}

void LPC32XXLCD::GetVirtualVideoMemory(
    unsigned long * pVirtualMemoryBase,
    unsigned long * pVideoMemorySize
    )
{
    *pVirtualMemoryBase = (unsigned)(m_pPrimarySurface->Buffer());
    *pVideoMemorySize   = m_FrameBufferSize;
}
